[{
        "id": 1,
        "img": "./staticAssets/siit.jpg",
        "university": "The Informal School of IT",
        "period": "Feb 2020 – Aug 2020",
        "title": "Front End Developer",
        "location": "Cluj County, Romania",
        "description": "During this six months of classes I learned how to build a User Interface web application unsing HTML5 and CSS. After diving into JvaScript I coverd some concepts like: variables, functions, objects and interconnect them with the browser with the DOM. Server based request (CRUD) using HTTP protocols (AJAX, fetch API and promises). I started to use the OOP model based programming and ES6 syntax. Learned the principles and basic commands in GIT and at the end basics of React.js conceps like: components (functional and class based components), props and state, react router and other lybraries."
    },
    {
        "id": 2,
        "img": "./staticAssets/utcn.png",
        "university": "Technical University of Cluj-Napoca, Faculty of Constuctions",
        "period": "2010-2012",
        "title": "Master’s Degree",
        "location": "Cluj County, Romania",
        "description": "Advanced engineering fundamentals on: environmental mechanics continues in the field of elastic and plastic behavior. Vehicle - roadway interaction and systems of administration of a road transport network;"
    },
    {
        "id": 3,
        "img": "./staticAssets/utcn.png",
        "university": "Technical University of Cluj-Napoca, Faculty of Constructions",
        "period": "2006-2010",
        "title": "Bachelor’s Degree",
        "location": "Cluj County, Romania",
        "description": "Specialized in the complex design of buildings from an engineering point of view, the composition and calculation of the resistance structures used and the most modern calculation methods (Robot Structural Analysis, MathCad, AutoCad), the evaluation of acoustic and thermal comfort in buildings, the execution of buildings and the management of construction works."
    },
    {
        "id": 4,
        "img": "./staticAssets/dragosvoda.png",
        "university": "National College 'Dragos Voda'",
        "period": "2002-2006",
        "title": "High School",
        "location": "Sighetu-Marmatiei County, Romania",
        "description": "Mathematics-Computer Science"
    }

]