[{
        "id": 1,
        "title": "Physical / Chemical Analysis Product Lead Engineer R&D",
        "img": "bosch.png",
        "company": "Robert Bosch GmbH",
        "period": "Aug 2017 – Present",
        "location": "Cluj County, Romania",
        "shortDescription": "Lead engineer in all activities regarding breaking systems, smart wheels and blower control units for Robert Bosch LTD: planning the analyses, organizing actions, executing analysis activities, improving processes and reviewing reports.",
        "workImg": "boschwork.jpg",
        "description": "I currently work for Robert Bosch LTD in Cluj-Napoca as lead engineer for the quality and validation department. In this context, I am responsible for the analysis activities regarding breaking systems, smart wheels and blower control units. This involves defining and documenting the product specific analysis methods based on the validation plan. In a second phase, I organise and execute the activities amongst the analysis team such as resources and time planning, and if the technical aspects are fully understood. I plan and perform failure analysis of electronic control units (ECUs) after design validation (DV) testing. I am make physical assessment of ECUs regarding ageing and damaging of all relevant components, their assembly and interconnect technologies by judging ageing indicators with respect to lifetime requirements based on material science knowledge.I also work on improving and adapting methods of analysis as required by new products/technologies such as the new smart wheel product. Since 2018 I am also responsible for reviewing the reports made by my colleagues before the approval stage."
    },
    {
        "id": 2,
        "title": "Procurement Consultant",
        "img": "siab.png",
        "company": "SIAB DEVELOPMENT",
        "period": "Jun 2016 – Aug 2017",
        "location": "Cluj County, Romania",
        "shortDescription": "Public procurement consultant: assisting beneficiaries in planning, documenting and participating at public biddings, budget analysis and legal compliance.",
        "description": "My responsibilities include all activities regarding tendering processes (planning, documenting, participating) in public procurements, cost-benefit analysis, legal compliance studies regarding the activities described before. Moreover, my job included public administration consulting with aspects regarding the budgets of several public entities (city halls, commune city halls, and others), public procurement, identifying inconsistencies and correcting them. Also, I used to collaborate and assist our business partners, subcontractors and third parties regarding the documentation for participation at tender procedures; this also includes requesting price offers and returning answers with requirements imposed by the applicable specifications of the procedure.",
        "workImg": "siabwork.jpg"
    },
    {
        "id": 3,
        "title": "Procurement specialist engineer",
        "img": "urbana.jpg",
        "company": "Urban Public Services",
        "period": "Apr 2013 – Jun 2016",
        "location": "Sighetu Marmatiei, Maramures, Romania",
        "shortDescription": "Public specialist engineer: planning, documenting and participating at public biddings, budget analysis and legal compliance, quality control management for completed projects and reports regarding field works. ",
        "description": "QHSE verifier for all managed projects / public works. My responsibilities include all activities regarding tendering processes (planning, documenting, participating), technical activities such as preparing technical drawings, documenting actions related to the field works and reporting errors and results, quality control for all completed projects, including field measurements and calculations and all activities regarding final reports.",
        "workImg": "urbanawork.jpg"
    }
]